{"title": "Haryana crisis: BJP govt in minority as 3 Independent MLAs withdraw support", "short_desc": "Three independent MLAs withdrew their support from the BJP government in Haryana and pledged their allegiance to the opposition Congress party.", "body": "A major political crisis hit Haryana on Tuesday as at least three independent MLAs withdrew their support from the BJP government and extended it to the opposition Congress party.\nRandhir Golan from Pundri, Dharampal Gonder from Nilokheri, and Sombir Singh Sangwan from Dadri announced their decision during a \n in Rohtak. Sangwan claimed that Rakesh Daultabad from Badshahpur was also expected to join them but was unable to reach the venue in time.\nAddressing the media, Dharam Pal Gondher expressed disappointment with the BJP government's handling of various issues.\n“At the time when they needed our support to form the government we were called again and again...We had decided that till the time Manoharlal Khattar was in power, we would support. We are sad that he is not in power anymore...In the interest of the farmers we withdraw the support from the government,” he said.\nRead: \nEchoing similar sentiments, Golan said the rising unemployment and inflation during the BJP's tenure in Haryana were key factors in their decision to withdraw support.\n\"For the last 4.5 years, we extended support to the BJP. Today unemployment and inflation are at their highest. Looking at this, we have withdrawn our support\".\nThe Independent MLAs were reportedly disgruntled after not being inducted into the Saini government.\nRead: \nFormer Haryana chief minister and Congress leader Bhupinder Singh Hooda welcomed their saying it reflects the lack of trust in the current government and the growing support for Congress among the people.\n“Their decision is right the right decision taken at the right time. It is in the interest of the people...There is a wave of Congress. I welcome them,” he said.\nThe three Independent MLAs have written to the Haryana governor informing him about the withdrawal of support from the BJP government. The BJP has 40 MLAs and has the support of two Independent MLAs - Nayan Pal Rawat of Prithla and Rakesh Daultabad of Badshahpur – and Gopal Kanda of Haryana Lokhit Party in the 88-member House, leaving the government in the minority.\nSpeaking at the presser, party's state unit chief Udai Bhan said, \"The three Independent MLAs -- Sombir Sangwan, Randhir Singh Gollen and Dharampal Gonder -- have withdrawn their support to the BJP government and extended their support to the Congress.\"\n“I also want to say that present strength of (90-member) Haryana Assembly is 88, of which the BJP has 40 members. The BJP government earlier had support of JJP MLAs and Independents, but JJP had also withdrawn support and now Independents are also leaving.”\n\"Nayab Singh Saini government is now a minority government. Saini should tender his resignation as he does not have right to stay even for a minute,\" said Bhan."}
{"title": "‘Milind Soman should have…’: Bureaucrat on Puma ad showing actor running on railway tracks", "short_desc": "The IRAS officer urged Puma to put a disclaimer on the ad showing Milind Soman jogging on railway tracks. ", "body": "An Indian Railway Accounts Service (IRAS) officer, Ananth Rupanagudi, shared his disagreement with the \n ad featuring actor Milind Soman. The advertisement shows \n jogging on a railway track, which the officer says is “treated as trespassing”. He also tagged the brand and urged them to put a disclaimer on the advertisement.\n“I have a problem with this ad, Puma. Railway tracks aren’t meant for jogging, and it’s treated as trespassing. Milind Soman - you should have verified this before shooting this ad,” wrote Rupanagudi on X. He added, “Puma, please put a disclaimer on this ad.”\nThe video was shared on May 5. It has since then garnered over 11,000 views. Additionally, the video has received a flurry of likes and comments.\n“Deserted track or is it the artificial track created for advertisement,” posted an individual. To this, Rupanagudi replied, “I believe it’s the railway track in the Borivali National Park. But running on the track of Indian Railways is fundamentally wrong. The messaging of the ad is not correct.”\nAnother added, “You can’t expect Milind Soman to verify this as he is the ‘model’. If at all, the agency who created this ad and perhaps the manufacturer - Puma - are responsible.”\nTo this, the Rupanagudi said, “Well, there’s something called common sense. Maybe it’s not so common.”\n“This ad was definitely shot at Borivali National Park. Several familiar buildings are visible. The railway line is, of course, the tiny NG line in the park,” said a third.\nRupanagudi replied, “It’s not about where it is shot but the messaging in the ad. It would convey that it’s okay to jog and run on the tracks, which isn’t correct. Just like one of the ads that glorified alarm chain pulling.”"}
{"title": "Before killing 3-year-old son, mom made him say ‘goodbye’ to father on camera", "short_desc": "Authorities have been piecing together the last hours of Savannah Kriger and her son Kaiden, who were found dead on March 19 from gunshot wounds to the head. ", "body": "Savannah Kriger, 32, from Texas, USA, asked her three-year-old to say \"goodbye\" to his father before she shot him and herself dead. As per reports, authorities have been piecing together the last hours of Kriger and her son Kaiden, who were found dead on March 19 from gunshot wounds to the head in a San Antonio park. The investigation into the murder-suicide has taken weeks.\nAuthorities concluded that in the hours preceding the killings, Kriger had damaged her ex-husband's house, shot at her old wedding pictures, and threatened him with several FaceTime videos and texts, reported the \nBexar County Sheriff's Office told the outlet that on March 18, Kriger went to her ex-husband's home when he left for work. After damaging a few of his furniture and personal items, she went home and shot her wedding pictures. Later, she picked up her son from daycare and sent texts to her ex-husband. (Also Read: \n)\n\"You don't have anything to go home to now. You really don't. You won't have anything at all at the end of the day,\" Kriger apparently said, as per the New York Post. A final text from her read, \"Say goodbye to your son.\"\nKriger and her ex were due for a hearing in the court on March 19, the day the bodies were discovered. (Also Read: \n)"}
{"title": "Delhi’s ‘Vada Pav Girl’ spotted with Ford Mustang, says ‘something big is coming soon’", "short_desc": "While many congratulated Delhi’s Vada Pav Girl on her new ride - Ford Mustang, others dropped encouraging words in the comments section. ", "body": "Chandrika Dixit, famously known as Vada Pav Girl, in her latest video, hints that “something big is coming soon” as she sits in her car boot. This comes after a video of her altercation with locals while she was organising a community feast near her stall went viral online.\nDixit shared the video on Instagram with a caption in Hindi. When translated to English, it reads, “Vada Pav girl started selling vada pav in Mustang car.”\nThe video opens to show a man saying, “\n[There’s a mustang parked in front of me and people have gathered around it. So, let’s find out why so many people are here]?”\nAs the video goes on, the man behind the camera continues, “\n[Let’s see what’s going to come out of Mustang]?” The video then shows Dixit lying in the boot of the car. She then says that something big is coming soon with vada pao. Towards the end of the video, she sits behind the wheel, all set to drive the car.\nThe video was shared a day ago on Instagram. Since then, it has collected over 4.9 lakh views and still counting. A few Instagram users even took to the comments section of the post to share their thoughts.\n“Congratulations \n[sister],” posted an individual.\nAnother added, “Keep it up.”\n“Very nice, sister,” expressed a third.\nA fourth said, “Great,” while a fifth joined, “Good”.\nDixit left her job at Haldiram to start her own vada pav stall in Sainik Vihar, Delhi. However, things took a difficult turn when a video of her crying went viral. In the video, she tearfully explained that officials from the Municipal Corporation of Delhi (MCD) were pressuring her to shut down her stall. She also said they were asking for more money, even though she had already paid them \n30,000-35,000."}
{"title": "RR coach lavishes praise on captain Sanju Samson's management: 'It's exciting to see his leadership'", "short_desc": "Bond heaped praise on Samson and said that he had learned how to manage his time and energy, which is crucial in a tournament like IPL.", "body": "Rajasthan Royals bowling coach Shane Bond lavished praise on skipper Sanju Samson for his leadership in the ongoing season of IPL. Samson has led his team from the front this season as the Royals are inches away from reaching the playoffs. The inaugural champions have put up collective effort on the field and have won 8 matches out of 10 so far, and the win will help them qualify for the next round.\n, who was criticised for his inconsistency in the last few seasons, played with a lot of maturity this edition and scored 385 runs in 10 matches including four half-centuries. The flamboyant batter has taken the onus on himself to take his team over the line on several occasions. He also got picked in India's squad for the \n after a sublime show in the cash-rich league.\nBond heaped praise on Samson and said that he had learned how to manage his time and energy, which is crucial in a tournament like \n.\n\"I am really impressed obviously coming into this team for the first time. It's been fantastic, he (Samson) is a fun guy. I think what he has been learning for the couple of years is managing his time, managing his energy. IPL is an energy-sapping competition, especially the backend and it's exciting to see his leadership. He has played beautifully and I am happy that he has been selected in the T20 World Cup squad,\" Shane Bond said in the pre-match press conference.\nBond further hailed his players for consistent performances this season as they have failed to get over the line twice so far.\n\"We only lost 2 games in the tournament so we understand we are a tough team to beat. Credit to the boys, they played beautifully throughout the tournament,\" Bond added.\nThe Royals hold second place in the IPL 2024 standings with 16 points after winning 8 of 10 matches. They will face Delhi Capitals on Tuesday at Arun Jaitely Stadium. They will enter into the match after losing against the Hyderabad-based franchise by just one run and will be desperate to bounce back and seal the place in the playoffs."}
{"title": "Met Gala 2024: Zendaya sends fans into frenzy with fourth iconic look at after-party", "short_desc": "With social media already buzzing with chatter about her sudden outfit change, Zendaya only fanned the flames with two more looks", "body": " not only served one but two iconic looks at the \nred carpet. With social media already buzzing with chatter about her sudden outfit change, the Dune star only fanned the flames with two more looks- a plunging neckline Celia Krithariorti gown inside the event and a silvery-blue halter-neck gown during the after-party. With four back-to-back serves, fans can't help but commend her efforts.\nFor her fourth and final look at fashion's biggest night, \n opted for a simpler yet equally stunning ensemble. Her sombre look featured a silvery-blue pleated skirt-style halterneck gown with a thigh-high slit. The stylish halterneck was encrusted with diamonds, adding a bling factor perfectly apt for dancing the night away after the star-studded after-party.\nShe completed her look with black high heels and a simple earring, keeping it minimal. The \n star kept her hair in a sleek bun with a soft yet dewy glam makeup look. Just hours earlier, Zendaya shut down the glamourous event in a custom Celia Krithariorti gown that featured a plunging neckline. She added a unique factor to her third look with no eyebrows!\nAs fashion's biggest night ended with a bang, fans flocked to social media to laud Zendaya for delivering four iconic looks. The Euphoria star's fans couldn't help but shower her with praises for each serve. One fan wrote on X, formerly Twitter, “Zendaya didn’t conquer the Met Gala steps once, BUT TWICE tonight!!!” Another said, “Zendaya wasn't just in the theme; she WAS THE THEME.”\nAnother fan commented, “ladies and gentlemen please go home, zendaya did what no one else in that room could with not just one BUT TWO LOOKS.”"}
{"title": "Kieron Pollard hints no rest for Jasprit Bumrah in remaining matches: 'We're all here to play an entire IPL'", "short_desc": "Kieron Pollard stated that the team's plan is to play an entire plan and not think much about things that are too far ahead of them.", "body": "Mumbai Indians assistant coach Kieron Pollard has hinted that the franchise is not thinking of giving rest to premier India pacer Jasprit Bumrah in the remaining matches of IPL. Five-time champions MI are struggling this season with just four wins in 12 matches as they are placed at the ninth spot on the points table. They still have a slim mathematical chance of qualifying for the playoffs\nhas been the standout bowler for MI this season and leading the \n race at the moment with 18 wickets in 12 matches. However, some fans want \n and Co. to take a bold decision to rest Bumrah for the rest of the matches to keep him fresh for the T20 World Cup 2024.\nMeanwhile, when Pollard was asked about the same in the post-match press conference on Monday, he indicated that they don't have such plans.\n\"I certainly haven't had any discussions about that,\" Pollard told media after the game when asked if there are any plans to rest Bumrah from MI's remaining two matches keeping in mind the upcoming T20 World Cup.\nThe former MI all-rounder stated that the team's plan is to play an entire plan and not think much about things that are too far ahead of them.\n\"I don't think that's my role and function at this point in time. But let's see what happens. We are all here to play an entire IPL. Sometimes when we think too far ahead of different things, thinking about World Cups, all these things could affect performances even from before the team was selected,\" he further added.\nPollard further said their main aim is to finish the season on a high.\n\"For us and in our camp, the most important thing is finishing off the IPL and let's see what happens after that. When he leaves the IPL and he goes into the Indian team, I think that's where that concession will take place,\" Pollard added.\nMI's last IPL game is against Lucknow Super Giants at home on May 17. The T20 World Cup, to be co-hosted by USA and the West Indies, will begin on June 1."}
{"title": "Rabindranath Tagore Jayanti 2024: 10 powerful quotes by the Nobel laureate that continue to inspire", "short_desc": "Rabindranath Tagore Jayanti 2024: From love to life, here is a list of powerful quotes by Tagore that gives us a fresh perspective.", "body": "Rabindranath Tagore Jayanti 2024: Rabindranath Tagore is celebrated as a timeless poet, novelist, author, playwright, songwriter and philosopher in West Bengal. The poet is known all over the world for his huge volume of work. Tagore is the first non-European to receive the Nobel Prize in \nin the year 1913. His works transcend emotions, revolution and devotion. Tagore also established Visva-Bharati University in the town of \n, tucked inside the district of Birbhum in West Bengal. Rabindranath Tagore is hailed as the Bard of Bengal and is worshipped and honoured for his works in the literary space.\nEvery year, Tagore's birth anniversary is observed with a lot of respect and honour by the Bengalis. According to the Gregorian calendar, his birth anniversary – affectionately referred to as Rabindra Jayanti – falls on May 7. However, according to the Bengali calendar, Rabindra Jayanti will be observed on May 8 this year.\nALSO READ: \nAs we gear up to celebrate the special day, here is a list of power quotes by the Bard of Bengal that helps us to gain a fresh perspective on life, love and emotions."}
{"title": "Drake's Toronto home taped off by cops following shooting that left 1 injured", "short_desc": "Police sealed off Drake's Toronto mansion on Tuesday following a shooting that left one person injured", "body": "Drake's Toronto mansion is at the centre of a police investigation following a shooting early Tuesday morning. The shooting took place outside the Canadian rapper's property in Bridle Path at around 2:10 am local time. \n "}
{"title": "Latest Entertainment News, Live Updates Today May 7, 2024: Drake's Toronto home taped off by cops following shooting that left 1 injured", "short_desc": null, "body": ""}
{"title": "Hardik Pandya shocked as Pat Cummins narrates how he lost part of middle finger due to mishap involving his sister", "short_desc": "It was a story Pat Cummins had first revealed back in 2011, shortly before his debut in South Africa", "body": "After the IPL 2024 match between Mumbai Indians and Sunrisers Hyderabad at the Wankhede Stadium in Mumbai on Monday, the two captain, Pat Cummins and Hardik Pandya were seen chatting, along with MI batter Suryakumar Yadav, and a glimpse of that moment indicated that the trio were talking about how the SRH skipper had lost his middle finger due to a mishap involving his sister.\nIn the video that went viral on social media after \n's seven-wicket win against \n, \nis seen walking up to \n, who was chatting with \n, who just smashed a match-winning 102 not out, and pointing towards his middle finger. The Australia captain is then seen recalling the incident with left both Hardik and Suryakumar shocked.\nIt was a story Cummins had revealed back in 2011 in an interview with cricket.com.au, shortly before his debut in South Africa. The incident happened when he was three or four years old, when his hand got slammed by a door, and as a result of it, he lost the top of his finger. He, however, admitted that it didn't affect him because the length of his middle finger is the same as the index finger.\n\"I lost the top of my finger when I was about three or four (years old),\" he had said. \"It got slammed in a door and I lost about a centimetre off the top of my finger. It doesn't really affect me because (the finger) is about the same length as the other one (index finger).\"\nThe New South Welshman then added: \"I still get my sister in tears ... (because) she slammed the door on it.\"\n \nTalking about the match, the win helped Mumbai stay alive in the race to the IPL 2024 playoffs, albeit with a bleak chance. They did earn their fourth win in the season, which lifted them to the ninth spot in the points table. Meanwhile, SRH stand fourth in the table with three teams - CSK and LSG being the others - locked on 12 points from 11 games."}
{"title": "KKR management 'blamed' for Rinku Singh's T20 World Cup snub: 'He was a hero last year. Now he lost his form'", "short_desc": "In the 11 matches, Rinku didn't get much opportunity to bat and faced only 101 balls, on which he hit 148 runs at a strike rate of 146.53.", "body": "Flamboyant batter Rinku Singh failed to make the cut into India's 15-member squad for the T20 World Cup which raised several eyebrows. Rinku was a consistent performer for India in the shortest format before the start of the IPL, but a lack of chances for KKR this season hampered his chances for the mega ICC event.\nbuilt his reputation as a finisher with his power-hitting show for \nin the last couple of seasons and match-winning knocks for India. In 15 T20Is he played for India so far, the left-handed powerhouse smashed 356 runs at an astonishing average of 89 and a strike rate of 176.23\nMeanwhile, he didn't get much chance to bat for KKR this season as the top order has been firing all cylinders for them. In the 11 matches, Rinku didn't get much opportunity to bat and faced only 101 balls, on which he hit 148 runs at a strike rate of 146.53.\nFormer India cricketer Ashok Malhotra has put the blame on KKR management for Rinku's T20 snub for not providing him with enough chances with the bat.\n“I will blame KKR management. He was a hero last year. But this year, he hardly got a chance to bat. And now when they are giving him a chance he is off-colour. He lost his form. He doesn’t seem to be in good nick,” Malhotra told RevSports.\nRinku has also been seen a bit off-colour in recent times, as Malhotra connected it with him not batting much in the first half.\n“Last year he was scoring runs but this year he is struggling. And that is because almost half the tournament is over and he has hardly got a bat. So, I would have put the blame a little bit on KKR because they didn’t give him enough chance,\" he added.\nHowever, the 57-year-old suggested that Rinku should have been included in the main squad for his match-finishing abilities.\n“But despite of that selectors have picked him in the reserves. Although he deserved to be [in the main squad]. Because he is a guy who can bat in the late order. He can be a good finisher and we all know what he can do,” he added"}
{"title": "Babar Azam, Imad Wasim's heated argument at nets sparks tension in Pakistan camp ahead of T20 World Cup", "short_desc": "Earlier last week, Imad Wasim had quashed rumours of a rift between him, fast bowler Mohammad Amir and captain Babar Azam.", "body": "Just days after veteran Pakistan all-rounder Imad Wasim clarified that all his good between him and \"good friend\" Babar Azam, contrary to the long-standing rumour in the media, the two were spotted having a heated argument during Pakistan's preparation for the upcoming series against Ireland and England. The video sparked massive tension among Pakistan fans before the \n.\nThe video emerged on Monday evening where \nand Imad were seen having an animated chat in the presence of other \nteammates like Shaheen Afridi, where the all-rounder looked a bit angry before teammates tried to separate them.\nEarlier last week, Imad, who reversed his retirement decision to make himself available for the T20 World Cup selection, quashed rumours of a rift between him, fast bowler Mohammad Amir and captain Babar.\n\"There is nothing bitter between us. I, Babar, and Amir are very good friends. We fully support our captain and want to win the T20 World Cup 2024 under the captaincy of Babar Azam,\" Imad had said. \"You never know that Babar Azam is re-appointed as captain of Pakistan to win T20 World Cup 2024.\"\nPakistan are currently gearing up for the three-match T20I series in Ireland which will begin on May 10. They will play their next two matches on May 12 and 14. The Babar-led side will next take on England in a four-match contest away from home which will commence from May 22 onwards and end on the 30th. Pakistan will then depart for the USA for the World Cup. \nPakistan will begin their T20 World Cup campaign on June 6 against co-hosts USA in New York before taking on arch-rivals India at the same venue on June 9. With almost a month left before that mouth-watering clash, Babar recently opened up on how Pakistan want to keep Virat Kohli quite in the encounter and deny themselves an MCG repeat from the 2022 edition.\n\"As a team, you always plan against different teams and according to their strengths. We do not plan anything against one player. We plan for all 11 players. We do not know much about the conditions in New York and we will plan accordingly. He [Virat Kohli] is one of the best players and we will plan against him as well,\" he said."}
{"title": "T20 World Cup selection, press conference played a part in Rohit Sharma's nosediving IPL form: Pollock on India captain", "short_desc": "Pollock said the shift in focus for T20 World Cup may also have had an effect on Rohit Sharma's batting form in IPL 2024.", "body": "Rohit Sharma's form in IPL 2024 has nosedived. The Indian captain started by scoring 261 runs in the first six games of the Mumbai Indians but as the tournament moved on, runs started to desert him. In the next six matches, Rohit managed just 69 runs. His strike rate too has plunged. In the first half, he was scoring at 167 but in the last six, it has come down to 115.\nReacting to \n's sudden loss of form, former South Africa captain Shaun Pollock said people were talking about how not having the burden of captaincy has helped Rohit get his form back in the IPL but things have gone downhill in the last few games.\n\"He'll be disappointed with that. He got off to a fiery start. Some people were saying, 'Look he's no longer captain so he's getting back to his old form'. He's still got two more games so hopefully he fires before he heads off to the World Cup,\" Pollock said on \n.\nPollock said the mode of Rohit's dismissals would hurt him more. The MI opener got a leading edge while trying to hit a \n short-pitched delivery with a closed bat face and Heinrich Klaasen took a simple catch against Sunrisers Hyderabad in Wakhede on Monday.\n\"It's the manner in which he's getting out that will be more concerning for him. He's one of those when he's playing straight down the ground, there's not much that can go wrong, but he has tried to introduce a bit of a fiddly element to the game. To get the odd scoop here but he's popping the odd one up in the air. If he gets a good nut, he won't be too concerned, but to be honest, he's kind of got out to soft dismissals, to be honest,\" The South African great added.\nRohit was devasted, to say the least. Visuals of the MI great \n in the MI dressing went viral during the MI vs SRH match.\nPollock said the shift in focus for T20 World Cup may also have had an effect on Rohit's batting form. \n\"I presume for the last few weeks, there has been a few conversations about trying to pick the Indian team. With that stress of finding the right balance, which player should be picked, all of a sudden, you are back in captaincy mode…. The naming of the side, going to the press conference, explaining why you have picked a certain may have added to the stress,\" Pollock added.\nMI have very little hope of making it to the playoffs but Rohit would like to use the remaining two league games to get some valuable runs under his belt so that he doesn't go to the World Cup searching for form."}
{"title": "‘Don't talk to BCCI, please…’: Harshit Rana once bitten twice shy, chat with KKR head coach Chandrakant Pandit viral", "short_desc": "In a light-hearted conversation with KKR head coach Chandrakant Pandit, Rana was heard requesting his coach not to talk to BCCI about IPL 2024 scheduling.", "body": "Kolkata Knight Riders pacer \n would think twice in matters related to BCCI now. The right-arm pacer, who was suspended for one match and fined 100 per cent match fees for the send-off he gave to Delhi Capitals batter Abishek Porel, has officially entered the once-bitten-twice-shy zone.\nIn a light-hearted conversation with KKR head coach Chandrakant Pandit, Rana was heard requesting his coach not to talk to BCCI about scheduling. The conversation took place inside a flight, which had to be diverted to Guwahati because of inclement weather in Kolkata.\nThe KKR team was returning from Lucknow, where they played against LSG and \n to rise to the top of the IPL 2024 points table on Sunday. The team was supposed to fly back to Kolkata on Monday evening, but KKR's chartered flight had to be diverted to Guwahati due to heavy rains in the City of Joy.\nThe flight landed in \n on Monday. It was around that time the conversation between Rana and Pandit took place where the player-coach duo were jokingly discussing having a practice session there and preponing their last league match against RR, which is scheduled in Guwahati on 19th of this month.\n “\n (Let's do one thing, keep a practice session here).”\n \"\n. (Yes, one session here and then we can also play our last league match here)\n \"\n. \"We have the match on 19th. Lets get it done with by tomorrow or day after so that we don't have to come here again)\n \"\n. (Let me see, what I can do. Will have to talk to BCCI)\"\n \"\n (Don't talk to BCCI).\"\nRana, who was fined 60 per cent of his match fees for giving a flying-kiss send off to Sunrisers Hyderabad batter Mayank Agarwal in an earlier match, almost repeated the same offence when he knocked over Porel in their game against Delhi.\n \nRana was seen pointing his hand towards Porel, indicating him to go back to the pavilion and was about to give another flying kiss before he stopped short of doing that. He was also seen appealing excessively after hitting Rasikh Salam high on his pads.\nIt was deemed as a Level 1 offence and Rana was suspended for a match.\nRana has been in top form in this IPL. The right-arm pacer, with 14 strikes to his name, is KKR's joint-highest wicket-taker, along with Sunil Narine.\nMeanwhile, the KKR's second attempt to land in Kolkata also failed. Their flight was diverted to Varanasi, where the team decided to stay. They are slated to land in Kolkata around 1:30 pm on Tuesday, provided the weather permits."}
{"title": "NEET 2024: UG Medical entrance test today, 10 points candidates should know", "short_desc": "NEET 2024: Here are ten things candidates should know before appearing in the NEET UG exam.", "body": "NEET 2024: The National Eligibility cum Entrance Test-Undergraduate or NEET UG 2024 will take place today, May 5. The 2024 edition of the undergraduate entrance examination for more than 24 lakh students will be held in a single shift, from 2 pm to 5:20 pm (Indian Standard Time) at 557 cities across the country and 14 cities outside India. \nAhead of the examination, here are ten points the candidates should remember. "}
{"title": "Janhvi Kapoor has a hilarious response to Tirupati wedding rumours with Shikhar Pahariya", "short_desc": "Janhvi Kapoor is dating Shikhar Pahariya, and often visits Tirupati Balaji Temple with him. But here's what she said to recent rumours of tying the knot.", "body": " is in no mood to entertain rumours about her personal life. Even as her relationship with Shikhar Pahariya has caught the media attention, the actor does not talk much about it. So, when a paparazzi page on Instagram shared that Janhvi will get married with Shikhar in Tirupati Temple in a gold saree, the actor shut the rumours down with a short but hilarious response. (Also read: \n)\nReacting to the paparazzi post on Instagram, Janhvi commented, “Kuch bhi (What even).” Several fans reacted with laughing face emoticons under Janhvi's comment. \nJanhvi opened up about her relationship when she appeared on the latest season of \n last year. During the show, Karan asked Janhvi about three people on her speed dial list. She replied, \"Papa, Khushu, and Shik..\" and then went 'oooo' as she got embarrassed.\nShikhar Pahariya is the grandson of the former Chief Minister of Maharashtra, Sushilkumar Shinde. He and Janhvi reportedly dated earlier and later parted ways for unknown reasons. The couple are now back together as they have been spotted a lot of times together.\nJanhvi and Shikhar offered prayers at Tirupati Temple earlier this year in January. Last month, Janhvi attended the premiere of \n in Mumbai. She wore a white suit to the event and even wore a chain around her neck with the word ‘Shikhu’ on it. It is the nickname she has given to him.\nJanhvi was last seen in \n with Varun Dhawan. She will be next seen in Mr. & Mrs. Mahi and Ulajh. She will also make her Telugu debut with Devara: Part 1. She also started shooting for her next, titled Sunny Sanskari ki Tulsi Kumari."}
{"title": "Summer pet care: Watch out for these common summer illnesses your pet may suffer", "short_desc": "From risk of dehydration and heatstroke, shedding to loss of appetite, your pet buddies need some extra care and attention in hot summer months.", "body": "While they may not always show signs of distress, \n can greatly affect your animal companion's health and well-being. From risk of dehydration and heatstroke, shedding to loss of appetite, your pet buddies need some extra care and attention in hot \nmonths. Majority of their health issues can be taken care by preventing heat exposure and keep them in a cooler zone of your house with adequate water accessibility. Ticks and fleas can also make their life tougher and it's important to take measures to guard your pets against them. Grooming and cleaning your pet also becomes essential in summer months to ensure they can breathe easily. (Also read: \n\"With every seasonal change, like humans, pets also tend to catch the change in weather. It is the pet parents' duty to note few dos and don'ts while taking care of them. Because like humans, these 'voiceless creatures' need your attention too as far as their diet and overall health are concerned,\" says Pet Nutritionist, Anjali Kalachand as she elaborates on few common issues faced by pets in the summer and shares simple preventive tips.\nAlthough ticks and fleas are present all year round there is a higher incidence of them in the summer. Always remember to check your pets post walks. Check paw digits, base of tail, armpits as ticks are notorious for hiding there. There is a plethora of natural tick and flea repelling sprays available on the market nowadays, however in spite of using those sometimes people may still find ticks and fleas on their pets. If that is the case it's best to use a medicated tick and flea solution to prevent the onset of tick fever.\nAs seasons change, your furry companions may face shedding of the undercoat. This is completely normal. Groom your pet regularly to help get rid of the extra fluff in your home. Use an omega-3 supplement for skin and coat health.\nAs the temperatures are soaring many of our pets are likely to suffer from dehydration or even worse heatstroke. Remember to be mindful of the time of the day you walk your pets at. Early mornings and late evenings are relatively more pleasant compared to rest of the day. If you feel your pet is panting more than normal, do avoid over exerting in this heat.\nAs the heat sets in, your furballs may show signs of inappetence or loss of appetite. You can cut down your pet's food slightly in the summer if that's the case. You can even look at including proteins with cooling energetics like duck and fish. Further additions like bone broth or yoghurt are a great addition to your pet's summer diet."}
{"title": "ICSE, ISC Result 2024 Live: CISCE results out, direct, pass percentage, other details here", "short_desc": null, "body": ""}
{"title": "CBSE Result 2024 Live: Class 10th, 12th results expected soon, updates here", "short_desc": null, "body": ""}
{"title": "Amazon Summer Sale 2024 brings discounts of up to 50% off on mattresses. Grab them as the sale ends in a few hours", "short_desc": "Whether you're seeking plush comfort, advanced support, or more, the Amazon Sale has got you covered with an extensive selection of mattresses at discounts.", "body": "Hurry, the clock is ticking! The Amazon Great Summer Sale 2024 is wrapping up soon, but there's still time to grab incredible discounts on mattresses and a variety of mattress types. Explore options like memory foam, latex, hybrid, and more, all at unbeatable prices. Don't miss out on the chance to transform your sleep with added comfort without breaking the bank!\n \nDiscover unbeatable comfort and support with memory foam mattresses during the Amazon Great Summer Sale 2024. Enjoy up to 50% off on these innovative sleep solutions designed to cradle your body and provide a restful night's sleep. Upgrade your bedtime routine with incredible savings!\nRevitalize your sleep experience with latex mattresses during the Amazon Great Summer Sale 2024. Enjoy savings of up to 50% on these premium mattresses renowned for their durability, support, and natural materials. Transform your bedroom into a haven of comfort and relaxation without overspending.\nUpgrade your sleeping experience with foam mattresses at unbeatable prices during the Amazon Great Summer Sale 2024. Enjoy discounts of up to 50% on these versatile mattresses, known for their comfort and support. Rest easy knowing you've invested wisely in quality sleep\nAlso read: \nGet ready to upgrade your bed with innerspring mattresses at great prices during the Amazon Great Summer Sale 2024. Enjoy discounts of up to 50% on these traditional mattresses, known for their sturdy support and bounce. Don't miss out on the chance to transform your sleep experience affordably. Grab yours before the sale ends!\nIn conclusion, the \n presents an excellent opportunity to avail fantastic discounts on mattresses and various types, including memory foam and latex. Seize this chance to enhance your sleep quality affordably. Don't let these incredible offers slip away!\nThe sale covers a wide range of mattresses, including memory foam, latex, hybrid, and more, ensuring there's something for every preference and budget.\nYes, the sale features discounts on mattresses from various well-known brands, offering you the opportunity to enjoy quality sleep at reduced prices.\nAbsolutely! With discounts of up to 50% off on mattresses, you can revamp your sleep experience without breaking the bank.\nThe duration of the Amazon Summer Sale 2024 is from 2nd May 2024 to 7th May 2024. Keep an eye on Amazon's official announcements and website for any extensions on the sale. But make sure you shop within the sale dates to enjoy the massive discounts."}
{"title": "Jain monks, VHP leaders visit historical Ajmer mosque, claim temple existed there", "short_desc": "The monks and the VHP leaders claimed that a Sanskrit school and a Jain temple existed at the spot.", "body": "A group of Jain monks and several leaders of the Vishwa Hindu Parishad on Tuesday visited ‘Adhai Din Ka Jhonpra’, an ASI-protected mosque in Rajasthan's Ajmer and claimed that a Sanskrit school and a Jain temple existed there, reported PTI.\nThe monks were led by Sunil Sagar Maharaj. They reached the monument from Fawara Circle via Dargah Bazaar.\nDeputy Mayor of Ajmer Municipal Corporation Neeraj Jain said that demands to redevelop Adhai Din Ka Jhonpra have been raised in the past as well.\n“We have in the past demanded that the monument should be redeveloped and its past glory restored,\" Jain said. \"There are idols kept in a store room in the monument.\"\nAccording to the Archaeological Survey of India (ASI) \n, the monument is a mosque built by Qutub-ud-Din-Aibak, the first Sultan of the Delhi Sultanate, in AD 1199.\nThe Adhai Din Ka Jhonpra is contemporary to the mosque at the Qutub Minar complex in Delhi. It is also known as Quwal-ul-Islam mosque (power of Islam).\n“Sultan Iltutmish had subsequently beautified it in AD 1213 with a screen pierced by corbelled engrailed arches which appears in this country for the first time,” the ASI said.\nIt adds: “A large number of architectural members and sculptures of temples are lying inside the verandah of the complex for safety and security purposes by the department which shows the existence of a Hindu temple in its vicinity during circa 11th-12th Century AD.”\nThe government agency also said that the name Adhai din ka Jhonpra is possibly driven from the fact that a fair used to be held here for two and a half days.\n“This mosque, built from the dismantled remains of temples, is known as Adhai-din-ka-Jhonpra possibly from the fact that a fair used to be held here for two and a half days,” the ASI said."}
{"title": "Dating tips to follow for a secure relationship: Relationship Specialist shares tips", "short_desc": null, "body": ""}
{"title": "NEET UG 2024 Live: Paper moderate to difficult, say experts; check students' reactions", "short_desc": null, "body": ""}
{"title": "World Thalassaemia Day 2024: Date, history and significance of the day", "short_desc": "World Thalassaemia Day is observed every year on May 8 to raise awareness around this genetic disorder, and support those who are struggling with it. ", "body": " is a genetic disorder characterized by insufficient haemoglobin production, leading to a shortage of red blood cells and, consequently, \n. While carriers of the thalassemia gene may lead normal lives, those with thalassemia major, have to undergo repeated transfusion, have increased susceptibility to various infections, hepatomegaly splenomegaly, bone issues and other health complications, including organ failure. Thalassemia can be of different types, but majorly can be alpha or beta. World Thalassaemia Day is marked every year on May 8 to raise awareness around this genetic disorder, and support those who are struggling with it and their caregivers, support research for its cure, and busting myths around the disease. (Also read | \nIn the year 1994, World Thalassaemia Day was first established by Founder of Thalassemia International Federation (TIF) Panos Englezos in the memory of his son George, who died of Thalassemia. The day was created to make efforts to fight the disease, remember those who lost their lives to it, and find a cure for it. It was also an attempt to bring together general public, public authorities, healthcare professionals, and industry representatives together spread awareness around prevention, management and treatment of the disease.\nThalassemia awareness also gained momentum through the efforts of patient support groups, healthcare professionals, and advocacy organizations around the world. These groups aimed to highlight the challenges faced by individuals living with thalassemia and their families, including the need for regular blood transfusions, iron chelation therapy, and access to quality healthcare.\nOn World Thalassemia Day, various activities and events are organized by healthcare institutions, patient support groups, and community organizations. These activities may include educational seminars, blood donation drives, fundraising events for thalassemia research and patient support, awareness campaigns through media and social platforms, and advocating for improved healthcare policies and services for thalassemia patients.\n\"Diagnostic tests, such as haemoglobin electrophoresis and DNA analysis, confirm thalassemia types and severity. Prenatal diagnosis by CVS/ Amniocentesis can help understand the status in womb. Preimplantation genetic testing {PGT (M)}, where embryos can be screened and the healthy embryo can be implanted. Early detection enables proactive management, including treatment plans and family planning decisions. Empowering individuals through education and accessible screening programs is crucial for prevention and improved outcomes,\" says Dr. Dipanjana Datta, BGCI Level II certified Genetic Counselor at Renew Healthcare.\n\"Early detection through the Hb HPLC blood test is crucial in managing thalassemia and securing the future well-being of generations to come. With informed decisions enabled by premarital screening, couples can navigate family planning and prenatal care effectively. Awareness and proactive measures like genetic counseling offer hope in preventing the birth of affected children. While thalassemia may not always be evident by appearance alone, its impact can be profound, necessitating lifelong treatments like blood transfusions and iron chelation in the absence of curative options. By emphasizing early detection and promoting premarital screening, we can alleviate the burden of this genetic disorder on families and healthcare systems, fostering healthier outcomes for all,\" says By Dr. Rahul Naithani Director & Head Hematology & Bone Marrow transplant, Paras Health, Gurugram."}
{"title": "India General Elections 2024 Live: 'Congress looted OBC reservation in Karnataka,' says PM Modi", "short_desc": null, "body": ""}
{"title": "Pakistani-origin woman, laid off by Elon Musk, starred in Tesla ad 2 months before job loss. Watch", "short_desc": "The laid-off Pakistani-origin engineer appeared in a Tesla ad two months ago, which showed how to use EV charges.", "body": "Bisma Rehman, a Pakistani-origin woman who claimed she lost her job amid the ongoing \n was featured in an ad for the company two months ago. The woman was fired, along with her team of over 500 people, after CEO Elon Musk announced that the company would reduce its workforce by 10% globally.\nTwo months ago, Rehman reshared a video of her ad on \n and wrote, “Starting today, Ford drivers have access to the majority of the Tesla Supercharger network via a NACS DC adapter. Big milestone achieved in creating a charging network for ALL. And Ford is just the automaker. More automakers are coming soon”. In the ad, she demonstrates how one can use the EV charges seamlessly without any hassle. The clip was officially posted on the Tesla LinkedIn page.\nTesla's layoffs have stretched into its fourth week, with many taking to LinkedIn to share how they lost their jobs at the company. A former Meta intern also claimed that \njust 72 hours before she was supposed to join. She shared that after being fired from her last job, she spent gruelling months filled with interviews and finally landed a job at Tesla. She claimed to have given up another opportunity to work at the company. She added that the whole experience left her “frustrated and heartbroken”.\nAs per \n, one of the laid-off employees showed the outlet the \"chilling\" email they received while being fired from their job at Tesla.\n\"I am reaching out to let you know that after a careful review of your permanent work restrictions and your role, it was determined that there was no reasonable accommodation that would enable you to perform the essential functions of your position in your role. The next step in the interactive process is the Alternative Job Search (AJS process), which consists of reviewing Tesla’s internal and external job board to identify potential positions. This is to inform you that we have not identified any openings for which you appear qualified. Given recent changes in the business, we also do not currently anticipate any such openings in the near term. As such, we are advising that we intend to conclude the AJS process at this time. As we have not identified an alternative available position, we will begin processing your separation from employment with Tesla, effective May 3rd, 2024,” it reads.\nAlso Read - "}
{"title": "TN 12th Result 2024 Live: 94.56% pass DGE Tamil Nadu HSE +2 exam, direct link", "short_desc": null, "body": ""}
{"title": "Cryptocurrency trader loses $68 million after falling for address poisoning scam", "short_desc": "The wallet named \"0x1E\" fell for a scam called address poisoning and lost $68 million. ", "body": "A cryptocurrency user lost $68 million in wrapped bitcoin (WBTC) after falling victim to an address poisoning attack. Cyvers Alerts, a \"security company that provides real-time detection and prevention of crypto attacks\", confirmed the incident and shared it on X.\nThe wallet named \"0x1E\" fell for a scam called address poisoning. The perpetrator mimicked the 0.05 ether (a form of cryptocurrency) transaction before receiving 1,155 WBTC from the victim. (Also Read: \n)\nAddress poisoning, as reported by \n, is a sophisticated strategy that involves replicating the first and last six characters of a genuine wallet address. This clever ploy aims to dupe the sender into overlooking the disparity in the intervening characters, leading to the transaction being sent to an incorrect wallet address. It's important to note that a wallet address can be up to 42 characters long.\nEarlier, \n caught the mastermind of a cryptocurrency scam where he defrauded investors of \n1.10 crores by promising high profits. The accused, named as Santosh Thorat, filed an anticipatory bail application with the high court seeking protection from arrest, which was denied, prompting his quick arrest by police.\nAccording to the cyber police, Thorat and his relatives offered investors 20% annual returns through the cryptocurrency Sonitex.\nThe accused had applied to the court for anticipatory bail, which was granted on the understanding that he would deposit \n43.96 lakh as the first instalment and the remaining \n65.94 lakh later. When the accused failed to make the required payments, he applied to the high court for anticipatory bail, which was denied. He then changed his phone number and residence address in order to avoid being arrested.\nThe investigation conducted by the cyber police led to his arrest in Kharadi on April 23, after which he was taken before the District and Sessions Judge Court."}
{"title": "Supreme Court stays Calcutta HC order cancelling over 25,000 school jobs, slams Bengal govt", "short_desc": "The court termed the alleged recruitment scam in West Bengal “systemic fraud” and said authorities were duty-bound to maintain the digitised records.", "body": "The Supreme Court on Tuesday stayed the Calcutta high court's order to terminate 25,000 teaching and non-teaching posts in state-run and state-aided schools of West Bengal. The decision came as a relief to thousands of individuals whose jobs were in jeopardy following the \n on April 22 that invalidated the appointment of 25,753 teachers and non-teaching staff in state-run and state-aided schools of West Bengal.\nThe apex court, however, refused to stay the CBI probe into the alleged school recruitment scam.\nHearing a \n challenging the high court's decision, a bench comprising Chief Justice D Y Chandrachud and Justices J B Pardiwala and Manoj Misra said that if the taint against nearly 8,000 teachers investigated by CBI is finally proved, the order of the high court will apply to the affected staff and they will have to refund their salaries.\n\"The public job is so scarce.... Nothing remains if the faith of the public goes. This is systemic fraud. Public jobs are extremely scarce today and are looked at for social mobility. What remains in the system if their appointments are also maligned? People will lose faith, how do you countenance this?\" the CJI asked the lawyers representing the state government.\nRead: \nThe bench said the state government has nothing to show that the data was maintained by its authorities and asked about its availability.\n\"Either you have the data or you do not have it…You were duty-bound to maintain the documents in digitised form. Now, it is obvious that there is no data. You are unaware of the fact that your service provider has engaged another agency. You had to maintain supervisory control,\" the bench told the state government's lawyers.\nThe West Bengal government had challenged the Calcutta high court order, saying it cancelled the appointments \"arbitrarily\".\nThe state in its appeal filed through advocate Astha Sharma said: “The high court has proceeded in a cursory manner to cancel all appointments of teachers and non-teaching staff, in utter disregard to the fact that the same will lead to a huge vacuum in the state schools, unless new selection process is completed by the SSC, especially when the new academic sessions is on its brim, leading to the students being adversely impacted.”"}
{"title": "Exclusive: Ranveer Singh and Deepika Padukone off on a romantic getaway; no trouble in paradise", "short_desc": "There has been buzz that trouble is brewing in celebrity couple Ranveer Singh and Deepika Padukone’s marital paradise. We get you the truth.", "body": "In the virtual world, rumours of turbulence in the marriage of Bollywood couple \nand \n have taken centerstage, ignited by the sudden disappearance of their wedding pictures from Ranveer's Instagram account. However, Hindustan Times exclusively learns that there is no truth to claims of marital discord. (\nAmidst the whirlwind of speculation, our sources reveal a different story altogether for the couple who are expecting their first baby together.\nWe learn that the couple is taking a break together, away from the hustle and bustle of Mumbai. “There is no truth to any claim about their marriage hitting a rough patch. It’s baseless. They are happy together, and constantly try to find a way out of their busy schedules, so that they can spend some quality time together,” says a source.\nThe source continues, “They are really excited to welcome their first child to the world, and are cherishing every moment of this phase of their life. In fact, Deepika and Ranveer are enjoying some quality time together on a quiet getaway in India”. (\nHere, it is to important to note that a photo of the couple has surfaced on social media, and is going viral. In the image, the couple appear to be on a vacation. In the newly surfaced snapshot, Deepika is dressed in a tan coloured overall, while Ranveer is wearing an all-white outfit. While the location is not clear, their well-wishers are speculating that they are on their babymoon.\nOn Tuesday, several eagle-eyed fans noticed that Ranveer had taken down the couple’s wedding pictures from his account. And that left several of them worried, wondering the reason behind it.\nWhen asked about the missing wedding pics from Ranveer’s Insta account, the source shared, “Well, he has deleted all his pictures from the year before 2022-2023. It is not just about his wedding pictures. In fact, all his recent pictures with Deepika are still on his handles. So, it is really baffling as to how people can assume that there is any trouble in paradise”.\nIn February this year, the couple announced on Instagram that they are expecting their first child. \"September 2024,\" read the picture embossed with baby shoes and clothing. (\nDeepika and Ranveer tied the knot in an intimate wedding ceremony in 2018 at Lake Como, Italy. They were secretly engaged for three years. The \n actor revealed on Karan Johar's chat show Koffee With Karan season 8 that he proposed to Padukone in 2015 during their vacation to the Maldives."}
{"title": "Video: AAP MLA Amanatullah Khan's son attacks petrol pump employees, booked", "short_desc": "Noida DCP Manish Kumar Mishra said Amanatullah Khan's son wanted to break the queue.", "body": "AAP MLA Amanatullah Khan's son allegedly attacked the staff of a petrol pump in Noida's Sector 95 area. The incident was captured by a CCTV camera. The Noida Police have registered a case against him.\nThe CCTV footage shows a man fighting with the staff of the petrol pump. He rushed down to get a spammer from the boot of his car and later charged at the staff of the facility, video further shows.\nNoida DCP Manish Kumar Mishra said Amanatullah Khan's son wanted to break the queue and get ahead at the petrol pump. When stopped, he attacked and threatened the staff of the petrol pump, he added.\nThe police officer claimed that AAP MLA Amanatullah Khan reached the petrol pump later and threatened its employees.\ns son wanted to break the queue and forcefully get petrol at the fuel station. He physically assaulted and threatened the fuel station's staff. Later, MLA Amanatullah Khan himself reached there and he also threatened the petrol pump employees. A case has been registered and action is being taken,\" he added.\nt month, \n appeared before the Enforcement Directorate in a money laundering case linked to alleged irregularities in the Delhi Waqf Board during his chairmanship.\nThe 50-year-old Aam Aadmi Party MLA from Delhi's Okhla was questioned by the Enforcement Directorate for over 13 hours.\nAAP leader Atishi had claimed that the ED's case against Amanatullah Khan was fake.\nThe controversial MLA had claimed that he had followed the rules when he was the chairman of the Waqf Board and did everything after taking legal advice.\nSeveral AAP leaders are under the Enforcement Directorate's scanner over a host of corruption cases. \nand Manish Sisodia, AAP's most prominent leaders, are in jail in connection with money laundering probes linked to the liquor policy case."}
{"title": "SS Rajamouli rues that India still looks at animation as something for children; calls it ‘surprising’", "short_desc": "Director SS Rajamouli opened up about the Disney+ Hotstar series, Baahubali: Crown of Blood, at a press meet in Hyderabad.", "body": "Director \n promoted the Disney+ Hotstar animated series Baahubali: Crown of Blood in Hyderabad. Talking to the press, he spoke about everything from why he thought this animated series was the right step forward for his Baahubali franchise to discussing how filmmakers in India should begin viewing animation as a good medium for storytelling. (Also Read: \n)\ncommented that in India, especially filmmakers, many look at animation as something for children, unlike other Asian countries. “It’s surprising that unlike Japan, a colourful country like India doesn’t go beyond children’s cartoons when it comes to animation. We still think of every story in terms of films. But in a country of crores of people, only 10 crore of them bought tickets for a film like Baahubali which was highly successful,” he claimed.\nHe added that even in Hyderabad, he knows there’s an audience for animation, unlike what most seem to think. “As filmmakers, we must step it up and explore all mediums. People like books, novels, games, \n(Asian animation). The idea is to take the story of Baahubali to people like them. And yet, look at us. We are still talking about the cliffhanger of Baahubali: The Beginning and how the film was effective when told in two parts. That mindset needs to change,” he added.\nRajamouli also spoke about how, in India, when a film is a hit, that’s as far as it goes. “When a brand is created in the West, it goes multi-media. We’ve tried making games, a VR film and a \nfor Baahubali so far, but nothing has panned out as expected,” he said, adding, “It took us time to get here, to find the right people. It also was difficult to break away and hand over the reins to Sharad (Devarajan, creator). But they did a good job with it and it's something that needed to happen.”\nShobu Yarlagadda, the producer of Baahubali films, also agreed, stating, “Baahubali films are only one part of a whole. It has multiple parts to it for becoming a tentpole franchise. This is adult entertainment, in the sense, it’s meant for everyone beyond kids. We wanted people to come into the world of Baahubali in multiple ways. We have so much more in store.”\nBaahubali: Crown of Blood is an animated series that will stream on Disney+ Hotstar from May 17 in multiple languages. The makers describe it as, “A dark chapter in the Mahishmati kingdom’s history that became its greatest challenge and shaped the future of its two prices, Baahubali and \n.” Rajamouli revealed that the story shown in the series takes place during the events shown in the Baahubali films."}
{"title": "Yuvraj Singh reveals Rohit Sharma 'hasn't changed' after success, confession sets India captain apart from Virat Kohli", "short_desc": "Yuvraj Singh opened up on his equation with Rohit Sharma and spoke abou how crucial the India captain is for the Men in Blue's chances at the T20 World Cup.", "body": " is all set to play his ninth \n, and ahead of the ICC event, no one wants to see the India captain hold that trophy more than \n, his teammate from the very first World T20 back in 2007. Rohit and Yuvraj share a close bond even after all these years, and the former India all-rounder has always been pretty vocal towards his support for the skipper.\nHaving come so close to realising his dream of winning the 50-overs World Cup, Rohit couldn't latch on to the trophy as India lost to Australia in the final. However, Yuvraj reckons Rohit, who won the 2007 edition in South Africa under MS Dhoni, deserves another World Cup title, and has no doubts he is the man to represent India at this global ICC event in West Indies and the USA.\n\"I really want to see Rohit Sharma with a World Cup trophy and a World Cup medal. He really deserves it,\" Yuvraj, the brand ambassador for the T20 World Cup, told ICC. (Rohit's presence is going to be) very crucial. I think we need a really good captain, a sensible captain who takes decisions well under pressure. And he's the one to take them. He was the captain when we lost in the (Cricket World Cup) 50-over final (in 2023). He has won five IPL trophies as a captain. I think we need somebody like him to captain India.\"\nCaptaincy credentials and batting prowess aside, what has floored Yuvraj the most about Rohit is that he has remained down to earth even after all these years of representing India. 17 years since his debut for India and Yuvraj claims Rohit hasn't allowed the success to get to his head. Recalling how, back in the day, Rohit would struggle in England but remained a gem of a person throughout, Yuvraj is proud to call him a friend and a close confidante.\n\"Very poor English. Very funny guy. From the streets of Borivali (in Mumbai), we always tease him. But a great guy at heart. The more success he's had, he has never changed as a person. That’s the beauty of Rohit Sharma. Fun-loving, always having fun with the guys, A great leader on the park and one of my closest friends from cricket,\" added Yuvraj.\nYuvraj's confession brought to light how contrasting his relationship is with both Rohit and Virat Kohli. While Yuvraj is pals with Rohit, his equation with Kohli is slightly different. During a podcast last year, Yuvraj revealed that he doesn't talk to Kohli as he is busy while also narrating the difference between the Virat Kohli of today and the 'Cheeku' that he knew in the late 2000s and early 2010s.\n\"Not really,\" Yuvraj said in the TRS Podcast when asked whether he is in touch with Kohli. \"I don't disturb him as he is busy. Young Virat Kohli's name was Cheeku. Today's Cheeku is Virat Kohli; there's a big difference.\"\nThe last time Kohli and Yuvraj were publicly spotted together was in Mohali just before the World Cup where India were playing Australia. The two former India teammates were seen having a lively chat in between the match."}
{"title": "Latest News, Live Updates Today May 7, 2024: Jain monks, VHP leaders visit historical Ajmer mosque, claim temple existed there", "short_desc": null, "body": ""}
{"title": "IPL 2024, DC vs RR IPL Live Score: McGurk slams 19-ball 50 as Rajasthan opt to bowl; Warner-less Delhi 115-3", "short_desc": null, "body": ""}
{"title": "'What are you doing?': SC pans IMA chief over adverse remarks on Patanjali misleading ads case", "short_desc": "The Supreme Court said why did the IMA chief gave the interview on the eve of the Patanjali case hearing.", "body": "The Supreme Court on Tuesday slammed Indian Medical Association (IMA) president RV Asokan for his adverse remarks against the court in the Patanjali misleading advertisements case.\nDuring the hearing today, the Supreme Court questioned senior advocate PS Patwalia about Asokan's comments. Patwalia appeared for the doctors' body.\nThe lawyer said his client's remarks were rather not fortunate. \"You are very mild with your words,\" the \nreplied.\n asked why did the IMA chief give the interview on the eve of the Patanjali case hearing last month.\nIMA's lawyer said his client was called for an interview by PTI. He said the doctor “fell into” what he called a \"leading question\".\n\"A doctor falling?\" Justice Amanullah said.\nThe court today pointed out that it was the doctors' body that had approached it against Acharya Balkrishna-led company for publishing misleading advertisements detrimental to modern medicine.\n\"You are the one coming to the court and saying that the other side are the ones misleading the public by advertisements, running your system of medicine down. What are you doing?\" the bench said.\nWhen RV Asokan's lawyer said the IMA president was praising the court, the bench said it didn't want any pat on \"our back from anybody\".\nThe court said the IMA chief's remarks were \"very, very unacceptable\".\nMeanwhile, senior advocate Mukul Rohatgi, appearing for Patanjali, told the bench that they have filed an application urging the court to take judicial notice of the \"wanton and unwarranted comments\" made by the IMA president.\nOn April 23, the Supreme Court, while hearing the Patanjali misleading advertisements case, had called out certain unethical practices by doctors.\nIn the interview later, Asokan said the \"vague and generalised statements\" had demoralised private doctors.\n\"We sincerely believe they need to look at what was the material before them. They perhaps did not consider that this was not the issue that was before them in the court. You can say anything but still a majority of doctors are conscientious... practising according to ethics and principles. It does not behove the Supreme Court to take a broadside against the medical profession of the country which, after all, sacrificed so many lives for the Covid war,\" he had said."}
{"title": "Lok Sabha elections: Over 61% polling recorded in third phase; Assam sees highest voter turnout", "short_desc": "Lok Sabha elections: Assam led the phase 3 polling with a voter turnout of 75.30%, followed by West Bengal with 73.93%, and Chhattisgarh with 66.99%.", "body": "Eleven states and territories including Prime Minister Narendra Modi's home state of Gujarat voted on Tuesday in the third phase of the Lok Sabha elections amid searing temperatures. May 7 polling covered 93 Lok Sabha seats as BJP bagged Surat unopposed after the nomination papers of the Congress candidate were rejected and the others withdrew from the race.\nA provisional voter turnout of around 61.5% has been recorded so far, as per EC data, with the highest polling witnessed in BJP-ruled Assam (75.30%) despite overcast skies and light rainfall in most areas. While the official time for voting to end is 6 pm, it can go beyond fixed polling hours to enable voters in the queue who have come well in time to exercise their franchise.\nAmong the four Lok Sabha constituencies in Assam that went to the polls today, Dhubri recorded the highest voter turnout at 79.7%, followed by Barpeta at 76.73%, Kokrajhar at 74.24% and Guwahati at 68.93%.\nWest Bengal registered around 73.9% voter turnout, with largely peaceful polling in four constituencies of two Muslim-majority districts.\nIn Chhattisgarh, seven of the 11 Lok Sabha seats that voted on Tuesday, a voter turnout of 66.99% was recorded. Polling was held in Raipur, Durg, Bilaspur, Korba, Janjgir-Champa, Surguja and Raigarh parliamentary constituencies.\nRead: \nA voter turnout of 63.19% was recorded across nine constituencies in Madhya Pradesh that went to the polls in the third phase. The highest turnout was in Rajgarh with 73.63%, followed by Vidisha (70.48%) and Guna (69.72%). Madhya Pradesh had recorded 58.59% and 67.75% polling in the first and second phases, respectively. Lok Sabha polls in Madhya Pradesh are being conducted in four phases. The fourth, which is the last phase of Lok Sabha polls in the state, will be held on May 13.\n11 out of the 48 Lok Sabha constituencies in Maharashtra witnessed a voter turnout of 54.98% in the third phase, according to election authorities. Among these, Kolhapur recorded the highest turnout at 63.71%, followed by Hatkanangale (62.18%), Latur (55.38%), Satara (54.11%), Ratnagiri-Sindhudurg (53.75%), Osmanabad (52.78%), Sangli (52.56%), Raigad (50.31%), Madha (50%), Solapur (49.17%), and Baramati (45.68%).\nRead: \nIn Gujarat, a voter turnout of 56.83% was recorded across 25 constituencies, as per EC data. The tribal-reserved Valsad constituency reported the highest turnout at 68.66%, while Amreli saw the lowest at 46.11%.\nA voter turnout of around 56% was recorded across five Lok Sabha seats in Bihar -- Araria, Jhanjharpur, Supaul, Madhepura, and Khagaria -- all currently held by the ruling NDA. Supaul witnessed the highest turnout at 58.91%, followed by Araria (58.57%), Madhepura (54.92%), Khagaria (54.35%), and Jhanjharpur (53.29%) by 5 pm.\nIn Uttar Pradesh, Agra witnessed 51.53 per cent polling, Aonla 54.73 per cent, Budaun 52.77 per cent, Bareilly 54.21 per cent, Etah 57.07 per cent, Fatehpur Sikri 54.93 per cent, Firozabad 56.27 per cent, Hathras 53.54 per cent, Mainpuri 55.88 per cent and Sambhal 61.10 per cent, the Election Commission (EC) said.\nVoter turnout of 66.14% and 66.71% respectively in the first two phases has been marginally lower than corresponding phases five years back, with analysts blaming the summer heat and the lack of a single strong issue to motivate voters."}
